In [13]:
# Importing libraries
import pandas as pd
import numpy as np
import os

In [14]:
path = r'C:\Users\marig\OneDrive\√Årea de Trabalho\curso arbeitsamt\data immersion\achievement 4\07.2023.Instacart Basket Analysis'

In [16]:
customer_df = pd.read_csv (os.path.join (path, 'Data', 'Original data', '4.6_customers', 'customers.csv'))

In [17]:
customer_df.shape

(206209, 10)

In [18]:
customer_df.head(10)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072

In [19]:
# Droping columns.
customer_df2 = customer_df.drop (columns = ['Gender'])

In [20]:
customer_df2.shape

(206209, 9)

In [21]:
customer_df2.head()

,user_id,First Name,Surnam,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Maryland,26,1/1/2017,1,married,40374

In [22]:
# Changing columns names
# Surname as last name and STATE to State
customer_df2.rename (columns = {'Surnam':'Last name'}, inplace = True)
customer_df2.rename (columns = {'STATE':'State'}, inplace = True)

In [23]:
customer_df2.head()

,user_id,First Name,Last name,State,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Maryland,26,1/1/2017,1,married,40374

In [24]:
customer_df2.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [25]:
print (customer_df2.dtypes)

user_id          int64
First Name      object
Last name       object
State           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [26]:
# Data consistency checks

# Mixed values:
for col in customer_df2.columns.tolist():
  weird = (customer_df2[[col]].applymap(type) != customer_df2[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customer_df2[weird]) > 0:
    print (col)

First Name

In [27]:
# Changing first name to string
customer_df2['First Name'] = customer_df2['First Name'].astype('str')

In [28]:
print (customer_df2.dtypes)

user_id          int64
First Name      object
Last name       object
State           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [29]:
# Missing values
customer_df2.isnull().sum()

user_id         0
First Name      0
Last name       0
State           0
Age             0
date_joined     0
n_dependants    0
fam_status      0
income          0
dtype: int64

In [26]:
# Fiding duplicates
df_dups = customer_df2[customer_df2.duplicated()]

In [27]:
df_dups

Empty DataFrame
Columns: [user_id, First Name, Last name, Gender, State, Age, date_joined, income]
Index: []

In [28]:
# Exporting data cleaned
customer_df2.to_pickle(os.path.join(path, 'Data', 'Prepared data','consumer_checked.pkl'))